read_verilog counter.v

synth -top counter

dfflibmap -liberty utils/primitives.lib

abc -liberty utils/primitives.lib

clean

write_json counter.json